/*********************************************************************************************************
* 模块名称: XXX.c
* 摘    要: 模块实现具体功能
* 当前版本: 1.0.0
* 作    者: XXX
* 完成日期: 2024年12月14日
* 内    容:
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Filter.h"
#include "DataType.h"
#include "UART1.h"
#include <math.h>
#include "50HzIIRFilter.h"
#include "100HzIIRFilter.h"
#include "200HzIIRFilter.h"
#include "LowerIIRFilter3.h"
#include <string.h>
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
int ECG_Filter_Flag=1;    //默认IIR滤波
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
void ECG_Filter_IIR(double* x);               //滤波
double  IIRFilterc(const double* b, const double* a, int n, int ns, double* px, double* py, double x);
void BaselineFilterTask(float *dataAddr);                  

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: ECG_Filter
* 函数功能: 心电滤波任务主入口
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void ECG_Filter(double* x)
{
  switch(ECG_Filter_Flag)
  {
    case 0:
      break;
    case 1:
      ECG_Filter_IIR(x);
      break;
    default:
      printf("ERROR:滤波器选择错误");
      break;
  }
}

/*********************************************************************************************************
* 函数名称: ECG_Filter_IIR
* 函数功能: 心电IIR滤波
* 输入参数: double* x ：输入数据的地址
            int N ：数据个数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void ECG_Filter_IIR(double* x)
{
  double x_temp = *x;
  // 初始化各节的缓存（px和py初始化为0）：50Hz陷波器
  int ECG_50Hz_n = 2;                  // 每节阶数
  int ECG_50Hz_ns = 1;        // 总节数
  static double s_ECG_50Hz_arrPx[12] = {0};
  static double s_ECG_50Hz_arrPy[12] = {0};
  
    // 初始化各节的缓存（px和py初始化为0）：100Hz陷波器
  int ECG_100Hz_n = 2;                  // 每节阶数
  int ECG_100Hz_ns = 1;        // 总节数
  static double s_ECG_100Hz_arrPx[12] = {0};
  static double s_ECG_100Hz_arrPy[12] = {0};

  // 初始化各节的缓存（px和py初始化为0）：100Hz陷波器
  int ECG_200Hz_n = 2;                  // 每节阶数
  int ECG_200Hz_ns = 1;        // 总节数
  static double s_ECG_200Hz_arrPx[12] = {0};
  static double s_ECG_200Hz_arrPy[12] = {0};

  // 初始化各节的缓存（px和py初始化为0）：50Hz低通滤波器
  int ECG_Lower_n = 2;                  // 每节阶数
  int ECG_Lower_ns = 1;        // 总节数
  static double s_ECG_Lower_arrPx[100] = {0};
  static double s_ECG_Lower_arrPy[100] = {0};

  x_temp=IIRFilterc((double*)&ECG_50Hz_NUM,(double*)&ECG_50Hz_DEN,ECG_50Hz_n,ECG_50Hz_ns,s_ECG_50Hz_arrPx,s_ECG_50Hz_arrPy,x_temp);
  x_temp=IIRFilterc((double*)&ECG_100Hz_NUM,(double*)&ECG_100Hz_DEN,ECG_100Hz_n,ECG_100Hz_ns,s_ECG_100Hz_arrPx,s_ECG_100Hz_arrPy,x_temp);
  x_temp=IIRFilterc((double*)&ECG_200Hz_NUM,(double*)&ECG_200Hz_DEN,ECG_200Hz_n,ECG_200Hz_ns,s_ECG_200Hz_arrPx,s_ECG_200Hz_arrPy,x_temp);

  x_temp=IIRFilterc((double*)&ECG_Lower_NUM,(double*)&ECG_Lower_DEN,ECG_Lower_n,ECG_Lower_ns,s_ECG_Lower_arrPx,s_ECG_Lower_arrPy,x_temp);
  
  BaselineFilterTask((float*)&x_temp);                  

  *x = x_temp;
}

/*********************************************************************************************************
* 函数名称： IIRFilterc
* 函数功能： 级联型 IIR 数字滤波器
* 输入参数： b  ：双精度实型二维数组，体积为 ns*（n+1）。存放滤波器分子多项式的系数，
*                 b[j][i] 表示第 j 个 n 阶节的分子多项式的第 i 个系数。
*            a  ：双精度实型二维数组，体积为 ns*（n+1）。存放滤波器分母多项式的系数，
*                 a[j][i] 表示第 j 个 n 阶节的分母多项式的第 i 个系数。
*            n  ：整型变量。级联型滤波器每节的阶数。
*            ns ：整形变量。级联型滤波器的 n 阶节数 L。
*            px ：双精度实型二维数组，体积为 ns*（n+1）。存放历史输入数据，初始状态必须为零。
*            py ：双精度实型二维数组，体积为 ns*（n+1）。存放历史输入数据，初始状态必须为零。
*            x  ：双精度实型变量。新的采样值；
* 输出参数： void
* 返 回 值： 滤波后的采样值
* 创建日期： 2023年10月10日
* 注    意：
*********************************************************************************************************/
double  IIRFilterc(const double* b, const double* a, int n, int ns, double* px, double* py, double x)
{
  int i, j, n1;
  n1 = n + 1;
  for (j = 0; j < ns; j++)
  {
    px[j * n1 + 0] = x;
    x = b[j * n1 + 0] * px[j * n1 + 0];
    for (i = 1; i <= n; i++)
    {
      x += b[j * n1 + i] * px[j * n1 + i] - a[j * n1 + i] * py[j * n1 + i];
    }
    for (i = n; i >= 2; i--)
    {
      px[j * n1 + i] = px[j * n1 + i - 1];
      py[j * n1 + i] = py[j * n1 + i - 1];
    }
    px[j * n1 + 1] = px[j * n1 + 0];
    py[j * n1 + 1] = x;
  }
  return x;
}

/*********************************************************************************************************
* 函数名称：BaselineFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
void BaselineFilterTask(float *dataAddr)                  
{
	static float b1[3],a1[3];  //第一节滤波系数 
	static float b2[3],a2[3];  //第二节滤波系数
  static float bufX[3],bufY[3];   
	
	b1[0]=1;b1[1]=-2;b1[2]=1;          //滤波器分子系数
	a1[0]=1;a1[1]=-1.990271241;a1[2]= 0.99042;      //滤波器分母系数	
	b2[0]=1;b2[1]=-2;b2[2]=1;          //滤波器分子系数
	a2[0]=1;a2[1]=-1.9768913542871;a2[2]= 0.9770474536;      //滤波器分母系数
  
	bufX[0] = *dataAddr;
	
	bufY[0] = -a1[1]*bufY[1]-a1[2]*bufY[2]+bufX[0]+b1[1]*bufX[1]+bufX[2];//第一节
	
	bufY[0] = -a2[1]*bufY[1]-a2[2]*bufY[2]+bufX[0]+b2[1]*bufX[1]+bufX[2];//第二节
	
	bufY[2]=bufY[1];bufY[1]=bufY[0];
	bufX[2]=bufX[1];bufX[1]=bufX[0];
	
	*dataAddr = bufY[0];
}
