/*********************************************************************************************************
* 模块名称: XXX.c
* 摘    要: 模块实现具体功能
* 当前版本: 1.0.0
* 作    者: XXX
* 完成日期: 2024年12月14日
* 内    容:
* 注    意:
**********************************************************************************************************
* 取代版本:
* 作    者:
* 完成日期:
* 修改内容:
* 修改文件:
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Filter.h"
#include "DataType.h"
#include "UART1.h"
#include <math.h>
#include "IIR5Filter.h"
/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              枚举结构体定义
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
int ECG_Filter_Flag=1;    //默认IIR滤波
/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/
void ECG_Filter_IIR(double* x, int N);               //滤波
void Filter(const double* b, const double* a, int m, int n, double* x, int len, double* px, double* py);  //IIR滤波算法

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称: ECG_Filter
* 函数功能: 心电滤波任务主入口
* 输入参数: void
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void ECG_Filter(double* x, int N)
{
  switch(ECG_Filter_Flag)
  {
    case 1:
      ECG_Filter_IIR(x,N);
      break;
    default:
      printf("ERROR:滤波器选择错误");
      break;
  }
}

/*********************************************************************************************************
* 函数名称: ECG_Filter_IIR
* 函数功能: 心电IIR滤波
* 输入参数: double* x ：输入数据的地址
            int N ：数据个数
* 输出参数: void
* 返 回 值: void
* 创建日期: 2025年11月26日
* 注    意:
*********************************************************************************************************/
void ECG_Filter_IIR(double* x, int N)
{
    // 初始化各节的缓存（px和py初始化为0）
  double px0[1] = {0}, py0[1] = {0};  // 节0：m=0→px长度1；n=0→py长度1
  double px1[3] = {0}, py1[3] = {0};  // 节1：m=2→px长度3；n=2→py长度3
  double px2[1] = {0}, py2[1] = {0};  // 节2：同上节0
  double px3[3] = {0}, py3[3] = {0};  // 节3：同上节1
  double px4[1] = {0}, py4[1] = {0};  // 节4：同上节0

  // 按顺序级联调用Filter函数
  Filter(NUM[0], DEN[0], NL[0]-1, DL[0]-1, x, N, px0, py0);  // 节0处理
  Filter(NUM[1], DEN[1], NL[1]-1, DL[1]-1, x, N, px1, py1);  // 节1处理（输入为节0的输出）
  Filter(NUM[2], DEN[2], NL[2]-1, DL[2]-1, x, N, px2, py2);  // 节2处理
  Filter(NUM[3], DEN[3], NL[3]-1, DL[3]-1, x, N, px3, py3);  // 节3处理
  Filter(NUM[4], DEN[4], NL[4]-1, DL[4]-1, x, N, px4, py4);  // 节4处理（最终输出）
 }

/*********************************************************************************************************
* 函数名称： Filter
* 函数功能： 直接性 IIR 数字滤波（一）
* 输入参数： b  ：双精度实型一维数组，长度为（m+1）。存放滤波器分子多项式的系数 b(i)。
*            a  ：双精度实型一维数组，长度为（n+1）。存放滤波器分母多项式的系数 a(i)。
*            m  ：整形变量。滤波器分子多项式的阶数。
*            n  ：整形变量。滤波器分母多项式的阶数。
*            x  ：双精度实型一维数组，长度为 len。开始时存放滤波器的输入序列，最后存放滤波器的输出序列；
*                 分块处理时，它用于表示当前块内的滤波器的输入序列与输出序列。
*            len：整型变量。输入序列与输出序列的长度；在分块处理时，它用于表示块的长度
*            px ：双精度实型一维数组，长度为（m+1）。在分块处理时，它用于保存前一块滤波时的（m+1）个输入序列值。
*            py ：双精度实型一维数组，长度为（n+1）。在分块处理时，它用于保存前一块滤波时的 n 个输出序列值。
* 输出参数： void
* 返 回 值： void
* 创建日期： 2023年10月01日
* 注    意： 当输入序列 x(k) 很长时，由于计算机内存的限制，常将其分成彼此衔接的若干块进行处理。数组 px 与
*            py 就是专为分块处理而设置的。
*            px 用于保存前一块滤波时的（m+1）个输入序列值，即 px[] = {x(k), x(k-1), ..., x(k-m)}；
*            py 用于保存前一块滤波时的 n 个输出序列值。即 py[] = {y(k-1), y(k-2), ..., y(k-n)}；
*            通常，我们假定滤波器的初始条件为零，因此数组 px[] 与 py[] 在滤波前都要初始化为零。
*********************************************************************************************************/
void Filter(const double* b, const double* a, int m, int n, double* x, int len, double* px, double* py)
{
  int k, i;
  for (k = 0; k < len; k++)
  {
    px[0] = x[k];
    x[k] = 0.0;
    for (i = 0; i <= m; i++)
    {
      x[k] = x[k] + b[i] * px[i];
    }
    for (i = 1; i <= n; i++)
    {
      x[k] = x[k] - a[i] * py[i];
    }
    if (fabs(x[k]) > 1.0e10)
    {
      return; //This is an unstable filter!
    }
    for (i = m; i >= 1; i--)
    {
      px[i] = px[i - 1];
    }
    for (i = n; i >= 2; i--)
    {
      py[i] = py[i - 1];
    }
    py[1] = x[k];
  }
}
