/*********************************************************************************************************
* 模块名称：Filter.c
* 摘    要：C语言滤波器模块
* 当前版本：1.0.0
* 作    者：Li Yuxuan
* 完成日期：2024年01月22日
* 内    容：
* 注    意：
**********************************************************************************************************
* 取代版本：
* 作    者：
* 完成日期：
* 修改内容：
* 修改文件：
*********************************************************************************************************/

/*********************************************************************************************************
*                                              包含头文件
*********************************************************************************************************/
#include "Filter1.h" 
#include "UART1.h"
#include "math.h"
#include "arm_math.h"

/*********************************************************************************************************
*                                              宏定义
*********************************************************************************************************/
#define FILTER_Notch_STAGE  1  //Iir陷波器的二阶滤波器的数量，总阶数为其2倍
#define FILTER_LOWPASS_STAGE  21  //Fir低通滤波器的阶数

/*********************************************************************************************************
*                                              枚举结构体
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部变量
*********************************************************************************************************/
//陷波器滤波函数需要用到的变量
static arm_biquad_casd_df1_inst_f32   s_IirNotchF32;                              //存放陷波器参数的结构体
static float32_t                      s_arrNotchStateF32[4 * FILTER_Notch_STAGE]; //陷波器滤波函数的状态缓存
static float32_t                      s_arrNotchCoeffF32[5 * FILTER_Notch_STAGE] = {
  1 , -1.6180339f , 0.999999f  , 1.56784120f , -0.9379f
};                                                                                //IIR陷波器系数表
static float  filterNotchInc = 0.968979f;                                         //IIR陷波器增益

//低通滤波函数需要用到的变量
static arm_fir_instance_f32           s_FirLowPassF32;                            //存放低通滤波器参数的结构体
static float32_t                      s_arrLowPassStateF32[FILTER_LOWPASS_STAGE + FILTER_NUM - 1];//低通滤波器滤波函数的状态缓存
static float32_t                      s_arrLowPassCoeffF32[FILTER_LOWPASS_STAGE] = {
   -0.001629781444,-0.0009817921091,0.0009114313289, 0.006431286223,  0.01770807244,
    0.03560006618,  0.05899040401,  0.08471384645,   0.1082079783,   0.1247171089,
     0.1306627542,   0.1247171089,   0.1082079783,  0.08471384645,  0.05899040401,
    0.03560006618,  0.01770807244, 0.006431286223,0.0009114313289,-0.0009817921091,
  -0.001629781444
};//FIR低通滤波器系数表

/*********************************************************************************************************
*                                              内部函数声明
*********************************************************************************************************/

/*********************************************************************************************************
*                                              内部函数实现
*********************************************************************************************************/

/*********************************************************************************************************
*                                              API函数实现
*********************************************************************************************************/
/*********************************************************************************************************
* 函数名称：FilterInit
* 函数功能：滤波器模块初始化
* 输入参数：void
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用FIR型滤波器
**********************************************************************************************************/
void FilterInit(void)
{
  //初始化IIR陷波器滤波函数  
  arm_biquad_cascade_df1_init_f32(&s_IirNotchF32, FILTER_Notch_STAGE, s_arrNotchCoeffF32,
  s_arrNotchStateF32);
  
  //初始化低通滤波器FIR滤波函数
	arm_fir_init_f32(&s_FirLowPassF32, FILTER_LOWPASS_STAGE, s_arrLowPassCoeffF32,
  s_arrLowPassStateF32, FILTER_NUM);
}

/*********************************************************************************************************
* 函数名称：NotchFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
void NotchFilterTask(float *dataAddr)                  
{
  //滤波
  arm_biquad_cascade_df1_f32(&s_IirNotchF32, dataAddr, dataAddr, FILTER_NUM);
  *dataAddr *= filterNotchInc;
}

/*********************************************************************************************************
* 函数名称：EMGFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用FIR型滤波器
**********************************************************************************************************/
void EMGFilterTask(float *dataAddr)                              
{
  //滤波
  arm_fir_f32(&s_FirLowPassF32, dataAddr, dataAddr, FILTER_NUM);
}

/*********************************************************************************************************
* 函数名称：BaselineFilterTask
* 函数功能：滤波器模块任务
* 输入参数：滤波数据的地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  采用IIR型滤波器
**********************************************************************************************************/
void BaselineFilterTask1(float *dataAddr)                  
{
	static float b1[3],a1[3];  //第一节滤波系数 
	static float b2[3],a2[3];  //第二节滤波系数
  static float bufX[3],bufY[3];   
	
	b1[0]=1;b1[1]=-2;b1[2]=1;          //滤波器分子系数
	a1[0]=1;a1[1]=-1.990271241;a1[2]= 0.99042;      //滤波器分母系数	
	b2[0]=1;b2[1]=-2;b2[2]=1;          //滤波器分子系数
	a2[0]=1;a2[1]=-1.9768913542871;a2[2]= 0.9770474536;      //滤波器分母系数
  
	bufX[0] = *dataAddr;
	
	bufY[0] = -a1[1]*bufY[1]-a1[2]*bufY[2]+bufX[0]+b1[1]*bufX[1]+bufX[2];//第一节
	
	bufY[0] = -a2[1]*bufY[1]-a2[2]*bufY[2]+bufX[0]+b2[1]*bufX[1]+bufX[2];//第二节
	
	bufY[2]=bufY[1];bufY[1]=bufY[0];
	bufX[2]=bufX[1];bufX[1]=bufX[0];
	
	*dataAddr = bufY[0];
}

/*********************************************************************************************************
* 函数名称：SmoothMean
* 函数功能：3阶平滑均值滤波器
* 输入参数：x-新的数据,data-用于滑动平均的缓冲区
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注    意：
*********************************************************************************************************/
float FilterSmoothMean(unsigned short x,unsigned short* data)          
{
	char i = 0;
	unsigned short sum = 0;
	unsigned short meanData = 0;

	for(i = 2; i > 0; i--)
	{
		data[i] = data[i-1];
	}
	data[0] = x;
	
	//计算均值
	for(i = 0; i < 3; i++)
	{
		sum = sum + data[i];
	}
	meanData = sum / 3;
	return (unsigned short)meanData;
}

/*********************************************************************************************************
* 函数名称：GetMidValue
* 函数功能：获取数据的中值
* 输入参数：data-数据缓冲区,len-数据长度
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  
**********************************************************************************************************/
float GetMidValue(float* data,unsigned short len)
{
	unsigned char i=0,j=0;
	float temp=0;
	float mid=0;
	
	if(len==0) return data[0];
	
	//冒泡排序
	for(i=0;i<len-1;i++)
	{
		for(j=0;j<len-i-1;j++)
		{
			if(data[j]>data[j+1])
			{
				temp=data[j+1];
				data[j+1]=data[j];
				data[j]=temp;
			}
		}
	}
	
	//获取中值
	(len%2==0)?(mid=(data[len/2] + data[len/2+1])/2):(mid=data[len/2]);
	
	return mid;
}

/*********************************************************************************************************
* 函数名称：FindArrMax,FindArrMin
* 函数功能：获取数组中的最值
* 输入参数：arr-数据缓冲区,num-数据长度,max/min-最值存放地址
* 输出参数：void
* 返 回 值：void
* 创建日期：2024年01月22日
* 注  意：  
**********************************************************************************************************/
void FindArrMax(float* arr,unsigned short num,unsigned short* max)
{  
  u16 i = 0,j = 0;
  
  for(i=0;i<num;i++)
  {
    if(j<arr[i])
    {
      j=arr[i];
    }
  }
  
  *max = j;
}

void FindArrMin(float* arr,unsigned short num,unsigned short* min)   
{
	u16 i = 0,j = 4096;
  
  for(i=0;i<num;i++)
  {
    if(j>arr[i])
    {
      j=arr[i];
    }
  }
  
  *min = j;
}
